In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
file_path = r'C:\Users\Sajit\OneDrive\Desktop\data mining\datasets\employees.csv'

In [4]:
data = pd.read_csv(file_path)

In [5]:
print("Original Data")
print(data)

Original Data
     First Name  Gender    Salary  Bonus %                  Team
0       Douglas    Male   97308.0    6.945                   MKT
1       Douglas    Male   97308.0    6.945                   MKT
2        Thomas    Male   61933.0    4.170                   NaN
3         Maria  Female  130590.0   11.858                   FIN
4         Jerry    Male  138705.0    9.340               Finance
...         ...     ...       ...      ...                   ...
997       Henry     NaN  132483.0   16.655          Distribution
998     Phillip    Male   42392.0   19.675               Finance
999     Russell    Male   96914.0    1.421               Product
1000      Larry    Male   60500.0   11.985  Business Development
1001     Albert    Male  129949.0   10.169                 Sales

[1002 rows x 5 columns]

In [6]:
data = data.dropna(axis=0)

In [7]:
data = data.drop_duplicates(keep='first')

In [8]:
if 'Bonus %' in data.columns:
    del data['Bonus %']

In [9]:
data['Team'] = data['Team'].str.replace('Fin', 'Finance', regex=False)
data['Team'] = data['Team'].str.replace('Mkt', 'Marketing', regex=False)
data['Team'] = data['Team'].str.replace('Financeance', 'Finance', regex=False)

In [10]:
print("Cleaned Data")
print(data)

Cleaned Data
     First Name  Gender    Salary                  Team
0       Douglas    Male   97308.0                   MKT
3         Maria  Female  130590.0                   FIN
4         Jerry    Male  138705.0               Finance
6        Dennis    Male  115163.0                 Legal
7          Ruby  Female   65476.0               Product
...         ...     ...       ...                   ...
996      George    Male   98874.0             Marketing
998     Phillip    Male   42392.0               Finance
999     Russell    Male   96914.0               Product
1000      Larry    Male   60500.0  Business Development
1001     Albert    Male  129949.0                 Sales

[763 rows x 4 columns]

In [11]:
output_path = r'C:\Users\Sajit\OneDrive\Desktop\data mining\datasets\employee.csv'
data.to_csv(output_path, index=False)

In [12]:
print(f"\nCleaned data saved to:\n{output_path}")

Cleaned data saved to:
C:\Users\Sajit\OneDrive\Desktop\data mining\datasets\employee.csv